"""
字面量：Python中用于表示数据的量

 Python中有六种数据类型：
 1.数字Number      包括整数（123）、浮点数（12.13）、复数（4+3j）、布尔（1为true，0为false）
 2.字符串String    描述文本的一种数据类型，有任意数量的字符组成
 3.列表List        Python中使用最频繁的数据类型，可有序记录一堆数据
 4.元组Tuple       可有序记录一堆不可变的数据集合
 5.集合Set         可无序记录一堆不重复的数据集合
 6.字典Dictionary  可无序记录一堆Key-Value型的数据集合

            数据类型        可修改       有序
 列表       可不同           是          是
 字符串     字符             否          是
 元组       变量             否          是
 字典       键值对           是          否
 集合       不重复变量       是          否
 
"""


# 打印整数
print(123)
# 打印浮点数
print(12.13)
# 打印字符串，字符串需要用引号括住
print("python学习")